import streamlit as st

st.title('⚙️생산경영 (Production Magagement)🔧')
st.subheader('➡ Optimizing Processes, Enhancing Efficiency')
st.write('')
st.write('')

st.header('1️⃣ Introduction to Production Management')
st.markdown(
'''
### 생산경영의 정의
: 생산경영은 제품이나 서비스를 효율적이고 효과적으로 생산하기 위해 자원을 계획하고 조직하며 통제하는 과정을 말합니다. 이는 생산 프로세스의 최적화를 통해 품질을 높이고 비용을 절감하며, 고객의 요구를 충족시키는 것을 목표로 합니다.

### 왜 생산경영에 관심을 갖게 되었는지
: 제가 생산경영에 관심을 가지게 된 이유는 경영학과 2학년 재학 도중 수강했던 <경영과 의사결정>이라는 과목이 매우 흥미롭고 재미있었기 때문입니다. 이 과목을 통해 경영 의사결정의 중요성과 그 과정에 대해 깊이 있게 이해하게 되었습니다. 그 후 <생산과 경영>이라는 강의를 통해 본격적으로 생산경영에 대해 배우게 되었으며, 이 분야의 매력에 빠지게 되었습니다. 이러한 이유로 산업데이터공학과를 복수전공하게 되었으며, 이를 통해 진로를 구체화할 수 있었습니다.
'''
)
